<?php

namespace Cnaebadi\PersianFaker\Faker;

class PersianFakerConstants
{
	 // Landline phone prefixes
	 public const LANDLINE_PHONE_PREFIXES = [
		  "021", // تهران
		  "025", // قم
		  "026", // کرج
		  "031", // اصفهان
		  "041", // تبریز
		  "044", // ارومیه
		  "045", // اردبیل
		  "051", // مشهد
		  "061", // اهواز
		  "071", // شیراز
		  "076", // بندرعباس
		  "011", // مازندران
		  "013", // گیلان
		  "017", // گلستان
		  "018", // قزوین
		  "086", // مرکزی
		  "024", // زنجان
		  "023", // سمنان
		  "038", // چهارمحال و بختیاری
		  "054", // سیستان و بلوچستان
		  "056", // خراسان جنوبی
		  "058", // خراسان شمالی
		  "066", // لرستان
		  "077", // بوشهر
		  "083", // کرمانشاه
		  "084", // ایلام
		  "087", // کردستان
		  "074", // کهگیلویه و بویراحمد
		  "034", // کرمان
		  "035"  // یزد
	 ];

	 // Domains
	 public const DOMAINS = [
		  'ir', 'com', 'co.ir', 'net', 'org', 'io', 'me', 'co'
	 ];

	 // Email prefix
	 public const EMAIL_PREFIX = [
		  'gmail.com', 'yahoo.com' ,'ymail.com', 'hotmail.com' , 'outlook.com' , 'icloud.com' , 'mail.com'
	 ];

	 // Protocols
	 public const PROTOCOLS = [
		  'http', 'https'
	 ];

	 // Mobile phone prefixes
	 public const MOBILE_PHONE_PREFIXES = [
		  "0910", "0911", "0912", "0913", "0914", "0915", "0916", "0917", "0918", "0919",
		  "0920", "0921", "0922", "0923", "0924", "0925", "0926", "0927", "0930", "0933",
		  "0935", "0936", "0937", "0938", "0939", "0990", "0991", "0992", "0993", "0994",
		  "0995", "0996", "0997", "0998", "0999"
	 ];

	 // Banks
	 public const BANKS = [
		  'بانک ملی ایران',
		  'بانک سپه',
		  'بانک صادرات ایران',
		  'بانک ملت',
		  'بانک تجارت',
		  'بانک مسکن',
		  'بانک پارسیان',
		  'بانک کشاورزی',
		  'بانک پاسارگاد',
		  'بانک دی',
		  'بانک سینا',
		  'بانک سامان',
		  'بانک آینده',
		  'بانک کارآفرین',
		  'بانک شهر',
		  'بانک توسعه تعاون',
		  'بانک قوامین',
		  'بانک سرمایه',
		  'بانک حکمت ایرانیان',
		  'بانک توسعه صادرات ایران'
	 ];

	 // English banks
	 public const ENGLISH_BANKS = [
		  'Bank Melli Iran',
		  'Bank Sepah',
		  'Bank Saderat Iran',
		  'Bank Mellat',
		  'Bank Tejarat',
		  'Bank Maskan',
		  'Bank Parsian',
		  'Bank Keshavarzi',
		  'Bank Pasargad',
		  'Bank Day',
		  'Bank Sina',
		  'Bank Saman',
		  'Bank Ayandeh',
		  'Bank Karafarin',
		  'Bank Shahr',
		  'Bank Tosee Taavon',
		  'Bank Qavamin',
		  'Bank Sarmaye',
		  'Bank Hekmat Iranian',
		  'Bank Tosee Saderat Iran'
	 ];


	 // Sentences
	 public const SENTENCES = [
		  'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
		  'بابا نان داد و علی آنرا خورد.',
		  'مشکلات اقتصادی گریبان گیر همه ی ما است.',
		  'تا شقایق هست زندگی باید کرد.',
		  'زندگی با داشتن آرامش روحی و روانی زیبا تر خواهد بود.',
		  'مشکلات ما با اطرافیانمان اغلب در نگرش ما است',
		  'ما تنها به دنیا می آییم و تنها از دنیا میرویم مهم آن است که بین دو تنها زندگی نکنیم.',
		  'آنجا که سکوت حاکم میشود موسیقی آغاز می شود.',
		  'هر روز یک روز زیبا برای انجام کار های درست است زمان را از دست ندهیم.',
		  'فرصت ها از دست ندهیم ، فرصت همیشگی نیستند.',
		  'زندگی از آن ماست ما آن را به روش خودمان پیش میبریم.',
		  'مرگ شروع یک زندگی دوباره است . با این جمله همگی خودمان در یک رویایی دست نیافتنی فرو میبریم.',
		  'تاریخ دو بار تکرار میشود : یکی به صورت تراژدی و دیگری به صورت کمدی.',
		  'کاری نکنیم که باعث شود از جهره خود در آینه فراری باشیم.',
		  'دریافت اطلاعات درباره نحوه دسترسی مخاطبان به سایت و نحوه رفتار آنها',
		  'مشخص کردن دامنه ایده آل برای سایت شما',
		  'مشخص کردن مشکلات موجود در عناوین و متای توضیحات صفحات سایت',
		  'شناخت کلیدواژ ه های برتر در جستجو که به دیده شدن سایت کمک می کند',
		  'ارائه یک نما از نحوه خوانش سایت توسط ربات های گوگل',
		  'دریافت پیام برای تخلفات سایت و ایجاد امکان درخواست تجدید نظر درباره تخلفات سایت',
		  'سایت مایکروسافت برای مرورگر بینگ ابزار وبمستری با امکاناتی مشابه امکانات ذکر شده ارائه داده است',
		  'دریافت اطلاعات درباره نحوه دسترسی مخاطبان به سایت و نحوه رفتار آنها',
		  'ست و پردازش سایت مپ sitemapیا نقشه سایت',
		  'در شبکه های اجتماعی فعالتر باشید',
		  'بیشتر مرورگرها از فرمت های فایل عمومی تصاویر مانند BMP ،PNG ،GIF ،JPEG پشتیبانی می کنند',
		  'هتر است تا جای ممکن از عکس های BMP استفاده نکنید. زیرا حجم زیادی اشغال می کنند',
		  'درج ویژگی Alt هنگامیکه از عکس بعنوان لینک استفاده می کنید',
		  'تحقیق کلمات کلیدی جزء مهمترین بخشهای سئو سایت میباشد',
		  'ایجاد آدرس شامل حروفی مرتبط با محتوای سایت ساختاری با کاربری بسیار ساده به آدرس سایت میدهد',
		  'ایجاد دسته بندی ها و نام های توصیفی در ساختار آدرس صفحات کمک میکند که سایت مرتب بماند',
		  'لینک ها میتوانند متن یا عکس یا کدهای جاوا اسکریپت و یا ترکیبی از آنها باشند',
		  'تجربه نشان داده است که موتورهای جستجو حتی پیچیده ترین ساختارهای درختی در سایت را به راحتی پردازش می کنند',
		  'گوگل پیشنهاد می کند که تمام سایت ها در صورت امکان از پروتکل Https استفاده کنند',
		  'با کمک گوگل وبمستر تعداد صفحات سایت که دارای ساختار خاص در نتایج جستجو هستند را مشاهده کنید',
		  'توضیحات متا ممکن است توسط گوگل به عنوان توضیحات صفحه در نتایج جستجو نمایش داده شود',
		  'توضیحات بخش متا به گوگل اعلام میکند که محتوای صفحه درباره چیست',
		  'این روزها کمتر کسی پیدا میشود که با USSD یا کدهایی که با ستاره شروع و با مربع تمام میشوند، آشنا نباشد',
		  'ژاپنیها را که میشناسید! عاشق سختی کشیدن و چالــش و کنــدن پوســت ســر از بازیکن براي رســیدن به یک تجربــه هیجانانگیز و رضایتبخش هستند',
		  'امروزه، نرمافزارهاي زیادي براي یادداشــتبرداري وجود دارند',
		  'زمانی پرداخت پولی بیش از سه میلیون تومان براي یکلپ تاپ، ولخرجی تمامعیاري به حساب میآمد'
	 ];

	 // Paragraphs
	 public const PARAGRAPHS = [
		  'داشتن یک دستیار هوشــمند براي انجام کارهاي مختلف بسیار خوب است، اما آیا میدانید دستیار گوگل ملقب به Google Assistant همه فرمانهاي صوتی شما را براي اجرا ابتدا در سرورهاي گوگل و در ادامه یک نسخه از آن را نیز در فضاي ذخیرهسازي شخصی شما ذخیره میکند؟',
		  'ایــن روزهــا تقریبا تمــام رایانهها قادر بــه اجراي سیستمعاملهاي 64 بیتی هستند، اما پشتیبانی رایانهها از این نسخه دلیل نمیشود تمام سیستمعاملهاي نصب شده توســط کاربران نیز نسخه 64 بیت باشد و ممکن اســت رایانه یک کاربر به نسخه 32 بیت سیستمعامل مجهز شده باشــد.',
		  'در وینــدوز 10 بــا غیرفعال کــردن ســرویس Windows Update و غیرفعال کردن Configure Automatic Updates درGroup Policy Editor - gpedit.msc بــا وارد شــدن به Update history چــه در بخش Settings و چه در بخــش Installed Update در Programs and Features هیــچ اثــري از آپدیتهــاي قبلی که نصب شــدهاند، وجود نــدارد و عبــارت No updates are installed on this computer مشــاهده میشــود.',
		  'زندگی همچون جریانی است که همواره به سوی جلو حرکت می‌کند. ما در مسیر این جریان قرار داریم و همیشه باید یاد بگیریم که چطور خود را با آن هماهنگ کنیم.',
		  'انسان‌ها همیشه در تلاشند تا در زندگی خود بهتر شوند، اما برای رسیدن به این هدف نیاز به زمان، تلاش و تغییرات مثبت در نگرش‌ها و رفتارها دارند.',
		  'باور داشته باشید که هر اتفاقی که در زندگی‌تان می‌افتد، در نهایت برای رشد و پیشرفت شماست، حتی اگر در ابتدا آن را منفی ارزیابی کنید.',
		  'هیچ چیزی در دنیا به اندازه تغییر خود فرد نمی‌تواند تاثیری عمیق بر دنیای اطراف بگذارد.',
		  'در دنیای امروز، داشتن ذهنی باز و پذیرش ایده‌های جدید یکی از مهمترین مهارت‌ها است.',
		  'هیچ وقت برای شروع مجدد دیر نیست. هر زمان که بخواهید می‌توانید تغییر کنید.',
		  'پذیرفتن اشتباهات و یادگیری از آن‌ها راهی است برای بهتر شدن.',
		  'افراد موفق کسانی هستند که از شکست‌های خود به عنوان سکویی برای پرش به سوی موفقیت استفاده می‌کنند.',
		  'زندگی به ما این امکان را می‌دهد که هر روز شروعی تازه داشته باشیم و از هر لحظه استفاده کنیم.',
		  'هیچ کس کامل نیست، اما همیشه می‌توانیم در جستجوی تکامل باشیم.',
		  'هر چه بیشتر تمرکز کنیم بر روی لحظات مثبت، زندگی‌مان بیشتر پر از شادی خواهد شد.',
		  'عادت‌های خوب می‌توانند درهای جدیدی به روی شما باز کنند و مسیر موفقیت را هموار کنند.',
		  'ایستادگی و پایداری در برابر مشکلات، نه تنها شما را قوی‌تر می‌کند، بلکه شما را به فردی با تجربه‌تر تبدیل می‌کند.'
	 ];

	 // States
	 public const STATES = [
		  "آذربایجان شرقی", "آذربایجان غربی", "اردبیل", "اصفهان", "البرز", "ایلام", "بوشهر", "تهران", "چهارمحال و بختیاری",
		  "خراسان جنوبی", "خراسان رضوی", "خراسان شمالی", "خوزستان", "زنجان", "سمنان", "سیستان و بلوچستان", "فارس", "قزوین", "قم", "کردستان",
		  "کرمان", "کرمانشاه", "کهگیلویه وبویراحمد", "گلستان", "گیلان", "لرستان", "مازندران", "مرکزی", "هرمزگان", "همدان", "یزد"
	 ];

	 // Streets
	 public const STREETS = [
		  'ولیعصر', 'خیابان انقلاب', 'فاطمی', 'شریعتی', 'مطهری'
	 ];

	 // Male firstnames
	 public const MALE_FIRSTNAMES = [
		  'امیر', 'علی', 'محمد', 'مهدی', 'حسین', 'رضا', 'سید', 'سینا', 'حسن', 'محمود',
		  'کاوه', 'آرمان', 'سعید', 'جواد', 'علیرضا', 'حمید', 'شهرام', 'بابک', 'پژمان',
		  'مجتبی', 'یوسف', 'ابوالفضل', 'مرتضی', 'داوود', 'فرید', 'کیوان', 'فرهاد',
		  'سهراب', 'امین', 'نادر', 'کیان', 'سیمین', 'پیمان', 'وحید', 'نادر', 'امید',
		  'شهریار', 'آرش', 'سامان', 'سیامک', 'سیاوش', 'یاسر', 'عرفان', 'ایمان', 'بهنام',
		  'کامران', 'مسعود', 'اسماعیل', 'سینا', 'ایمان', 'کوروش', 'نیما', 'امیرحسین',
		  'رضا', 'محمدمهدی', 'شاهین', 'پرویز', 'حبیب', 'تیمور', 'امیرعلی', 'علیرضا',
		  'جواد', 'سهراب', 'فرزاد', 'حمیدرضا', 'رادین', 'سپهر', 'کیارش', 'یعقوب',
		  'عادل', 'ناصر', 'سیدعلی', 'آرمان', 'آریا', 'افشین', 'بهنام', 'فرزاد',
		  'میلاد', 'آرمین', 'سام', 'کوروش', 'هادی', 'نبی', 'علیرضا', 'وحید', 'مجید',
		  'سجاد', 'کیانوش', 'اسماعیل', 'حسینعلی', 'حسن', 'یوسف', 'احمد', 'علی اصغر',
		  'محمودرضا', 'فرهاد', 'سینا', 'مهدی', 'کامران', 'شایان', 'نیما', 'حمید',
		  'رضا', 'ایمان', 'صادق', 'ساسان', 'رحیم', 'نیکان', 'ایمان', 'مهران', 'محمدحسین'
	 ];

	 // English male firstnames
	 public const ENGLISH_MALE_FIRSTNAMES =['amir', 'ali', 'mohammad', 'mahdi', 'hosein', 'reza', 'seyed', 'sina',
		  'hasan', 'mahmoud',  'kaveh', 'arman', 'saeed', 'javad', 'alireza', 'hamid', 'shahram', 'babak', 'pejman',
		  'mojtaba', 'yousef', 'abolfazl', 'morteza', 'davood', 'farid', 'keyvan', 'farhad',  'sohrab', 'amin',
		  'nader', 'kian', 'simin', 'peyman', 'vahid', 'nader', 'omid',  'shahriar', 'arash', 'saman', 'siamak',
		  'siavash', 'yaser', 'erfan', 'iman', 'behnam',  'kamran', 'masoud', 'esmaeil', 'sina', 'iman', 'kourosh',
		  'nima', 'amirhosein',  'reza', 'mohammadmahdi', 'shahin', 'parviz', 'habib', 'teymour', 'amirali', 'alireza',
		  'javad', 'sohrab', 'farzad', 'hamidreza', 'radin', 'sepehr', 'kiarash', 'yaagoub',  'adel', 'naser', 'seyedali',
		  'arman', 'aria', 'afshin', 'behnam', 'farzad',  'milad', 'armin', 'sam', 'kourosh', 'hadi', 'nabi', 'alireza',
		  'vahid', 'majid',  'sajad', 'kianoush', 'esmaeil', 'hoseinali', 'hasan', 'yousef', 'ahmad', 'ali asghar',
		  'mahmoudreza', 'farhad', 'sina', 'mahdi', 'kamran', 'shayan', 'nima', 'hamid',  'reza', 'iman', 'sadegh',
		  'sasan', 'rahim', 'nikan', 'iman', 'mehran', 'mohammadhosein'];


	 // Female firstnames
	 public const FEMALE_FIRSTNAMES = [
		  'زهرا', 'فاطمه', 'نسرین', 'مریم', 'نگار', 'سارا', 'مینا', 'لیلا', 'ندا', 'هانیه',
		  'بهاره', 'شهره', 'مهدیه', 'آرزو', 'زهره', 'راضیه', 'نسیم', 'شیما', 'سمیه', 'زینب',
		  'محدثه', 'مونا', 'الهام', 'سکینه', 'فرزانه', 'عاطفه', 'سید', 'پریناز', 'ساناز',
		  'فرشته', 'فریناز', 'سپیده', 'مهناز', 'طاهره', 'حسنا', 'گلی', 'ریحانه', 'رعنا',
		  'نرگس', 'غزاله', 'رونا', 'شیوا', 'میترا', 'مریم', 'عسل', 'پرستو', 'ماهیتا',
		  'مهتاب', 'یاسمن', 'شیدا', 'کیمیا', 'طیبه', 'مروارید', 'لاله', 'مسیحا', 'یگانه',
		  'النا', 'آسیه', 'صبا', 'ماندگار', 'دنیا', 'آناهیتا', 'مبینا', 'مرجان', 'سارا',
		  'پریسا', 'آرزو', 'ساینا', 'سمیرا', 'مریم', 'ترانه', 'نیکو', 'لادن', 'الینا',
		  'سکینه', 'مائده', 'لیلی', 'مرضیه', 'کاترین', 'پگاه', 'یاسین', 'آرزو', 'سمانه',
		  'سیما', 'نگین', 'مژگان', 'سهیلا', 'نیکو', 'سپیده', 'شیدا', 'آرمان', 'بیتا'
	 ];

	 // English female firstnames
	 public const ENGLISH_FEMALE_FIRSTNAMES =['zahra', 'fatemeh', 'nasrin', 'maryam', 'negar', 'sara',
		  'mina', 'leila', 'neda', 'hanieh',  'bahareh', 'shohreh', 'mahdiyeh', 'arezou', 'zohreh',
		  'razieh', 'nasim', 'shima', 'somayeh', 'zeynab',  'mojtaba', 'mona', 'elham', 'sakinah',
		  'farzaneh', 'atefeh', 'seyed', 'parinaz', 'sanaz',  'fereshteh', 'farinaz', 'sepideh',
		  'mahnaz', 'tahereh', 'hosna', 'goli', 'reyhaneh', 'rana',  'narges', 'ghazaleh', 'rona',
		  'shiva', 'mitra', 'maryam', 'asal', 'parastou', 'mahita',  'mahtab', 'yasaman', 'sheyda',
		  'kimia', 'tayyebeh', 'morvarid', 'laleh', 'masiha', 'yeganeh',  'elena', 'asieh', 'saba',
		  'mandegar', 'donia', 'anahita', 'mobina', 'marjan', 'sara',  'parisa', 'arezou', 'saina',
		  'samira', 'maryam', 'taraneh', 'nikou', 'ladan', 'elina',  'sakinah', 'maedeh', 'leili',
		  'marziyeh', 'katrin', 'pegah', 'yasin', 'arezou', 'samaneh',  'sima', 'nagin', 'mojgan',
		  'soheila', 'nikou', 'sepideh', 'sheyda', 'arman', 'bita'];



	// Lastnames
	 public const LASTNAMES = [
		  'حسینی', 'محمدی', 'موسوی', 'سلیمانی', 'رحیمی', 'قاسمی', 'رضوی', 'موسوی', 'آذری',
		  'مهدوی', 'هاشمی', 'خادمی', 'مظفری', 'عباسپور', 'کریمی', 'بابایی', 'حیدری',
		  'یزدی', 'امامی', 'سادات', 'احمدی', 'طاهری', 'زاهدی', 'شاهی', 'مرتضوی', 'علیزاده',
		  'نیکو', 'آقاخانی', 'عباسی', 'نیا', 'فلاحی', 'مجد', 'رحمان', 'عابدینی', 'پورهادی',
		  'جمشیدی', 'اکبری', 'موسوی', 'باقری', 'آذری', 'غفاری', 'تاجیک', 'جعفری', 'مقدم',
		  'شریفی', 'مرادی', 'نصراللهی', 'خانزادی', 'مقیمی', 'سلیمی', 'جعفری', 'یوسفی',
		  'خلیلی', 'رستمی', 'مشیری', 'محمودی', 'بیگی', 'فتحی', 'حسین‌زاده', 'سهرابی',
		  'ملاحسینی', 'زاهدی', 'صادقی', 'صدیقی', 'آرین', 'عباس‌پور', 'اعتمادی', 'پاکباز',
		  'علیپور', 'فردوس', 'رابعی', 'دانشور', 'نیازی', 'بهنامی', 'قنبری', 'پژوهش',
		  'زارعی', 'امین', 'صادق', 'قاضی', 'نوروزی', 'عباسی', 'نوری', 'شیرمحمدی',
		  'فرهمند', 'آقاجانی', 'نجفی', 'شاکری', 'مقدس', 'خسروی', 'حیدری', 'فرهادی',
		  'سلطانی', 'غفاری', 'مرادی', 'خواب‌باز', 'جلالی', 'فتح‌الهی', 'صدر', 'کوهی'
	 ];

	 // English lastnames
	 public const ENGLISH_LASTNAMES = ['hoseini', 'mohammadi', 'mousavi', 'soleymani', 'rahimi',
		  'ghasemi', 'razavi', 'mousavi', 'azari',  'mahdavi', 'hashemi', 'khademi', 'mozaffari',
		  'abbaspour', 'karimi', 'babaei', 'heydari',  'yazdi', 'emami', 'sadat', 'ahmadi', 'taheri',
		  'zahedi', 'shahi', 'mortezavi', 'alizadeh',  'nikou', 'aghakhani', 'abbasi', 'nia', 'fallahi',
		  'majd', 'rahman', 'abedini', 'pourhadi',  'jamshidi', 'akbari', 'mousavi', 'bagheri', 'azari',
		  'ghaffari', 'tajik', 'jafari', 'moghadam',  'sharifi', 'moradi', 'nasrollahi', 'khanzadi',
		  'mogheimi', 'salimi', 'jafari', 'yousefi',  'khalili', 'rostami', 'moshiri', 'mahmoudi',
		  'beigi', 'fathi', 'hoseinzadeh', 'sohrabi',  'mollahoseini', 'zahedi', 'sadeghi', 'sadeghi',
		  'arian', 'abbaspour', 'etemadi', 'pakbaz',  'alipour', 'fardous', 'rabiei', 'daneshvar', 'niazi',
		  'behnami', 'ghanbari', 'pazhouhesh',  'zarei', 'amin', 'sadegh', 'ghazi', 'norouzi', 'abbasi',
		  'nouri', 'shirmohammadi',  'farahmand', 'aghajani', 'najafi', 'shakeri', 'moghadas', 'khosravi',
		  'heydari', 'farhadi',  'soltani', 'ghaffari', 'moradi', 'khabbaz', 'jalali', 'fathollahi', 'sadr', 'kouhi'
	 ];

	 // Words
	 public const WORDS = [
		  'حساس', 'ترافیک', 'فروش', 'سایت', 'ارگانیک', 'افزایش', 'نرخ', 'سئو', 'کاربردی', 'ابزار', 'بهبود', 'تجربه', 'بهبود',
		  'فروشگاه', 'سرعت', 'جستجو', 'موتورهای جستجو', 'موبایل', 'آن ین', 'لینک', 'حرفه', 'کلیک', 'مخاطب', 'صفحه', 'تصاویر',
		  'اشتراک', ' شبکه ها اجتماعی', 'محصول', ' آن ین', 'توسعه دهنده', 'حرفه ای', 'فاکتور', 'بهینه سازی', 'ترافیک', 'پروتکل',
		  'امنیت', 'محتوا', 'دانلود', 'رایگان', 'استاندارد', 'خرید', 'رتبه بندی', 'الگوریتم های گوگل', 'وب گردی', 'وب گ نوس', 'مخاطب',
		  'رپورتاژ خبری', 'مقایسه', ' اط عات', 'نقشه', 'برچسب', 'بانک', 'چشمپوشی', 'اینترنت', 'پیامرسان', 'دولت', 'حمایت',
		  'هیولا', 'یادداشت', 'لینوکس', 'هوشمند', 'عروسک', 'رباتیک', 'کودکان', 'کتاب', 'روزرسانی', 'وبمستر', 'آنالیتیکس'
	 ];

	 // Jobs
	 public const JOBS = [
		  'برنامه نوسی', 'مدیر شبکه', 'مدیر آی تی', 'مسئول پشتیبانی', 'فروشنده', 'بازاریاب', 'طراح',
		  'گرافیست', 'کارگردان', 'بازیگر', 'آرایشگر', 'خیاط', 'عکاس', 'ورزشکار', 'ساست مدار', 'پلیس', 'استاد دانشگاه', 'معلم', 'پزشک', 'پرستار', 'مدیر', 'آشپز'
	 ];

	 // CITIES
	 public const CITIES = [
		  "سهند", "سیس", "دوزدوزان", "تیمورلو", "صوفیان", "سردرود", "هادیشهر", "هشترود", "زرنق", "ترکمانچای", "ورزقان",
		  "تسوج", "زنوز", "ایلخچی", "شرفخانه", "مهربان", "مبارک شهر", "تیکمه داش", "باسمنج", "سیه رود", "میانه", "خمارلو",
		  "خواجه", "بناب مرند", "قره آغاج", "وایقان", "مراغه", "ممقان", "خامنه", "خسروشاه", "لیلان", "نظرکهریزی", "اهر",
		  "بخشایش", "آقکند", "جوان قلعه", "کلیبر", "مرند", "اسکو", "شندآباد", "شربیان", "گوگان", "بستان آباد", "تبریز",
		  "جلفا", "اچاچی", "هریس", "یامچی", "خاروانا", "کوزه کنان", "خداجو(خراجو)", "آذرشهر", "شبستر", "سراب", "ملکان",
		  "بناب", "هوراند", "کلوانق", "ترک", "عجب شیر", "آبش احمد", "نالوس", "ایواوغلی", "شاهین دژ", "گردکشانه", "باروق",
		  "سیلوانه", "بازرگان", "نازک علیا", "ربط", "تکاب", "دیزج دیز", "سیمینه", "نوشین", "میاندوآب", "مرگنلر", "سلماس",
		  "آواجیق", "قطور", "محمودآباد", "خوی", "نقده", "سرو", "خلیفان", "پلدشت", "میرآباد", "اشنویه", "زرآباد", "بوکان",
		  "پیرانشهر", "چهاربرج", "قوشچی", "شوط", "ماکو", "سیه چشمه", "سردشت", "کشاورز", "فیرورق", "محمدیار", "ارومیه", "مهاباد",
		  "قره ضیاءالدین", "فخراباد", "کلور", "نیر", "اردبیل", "اسلام اباد", "تازه کندانگوت", "مشگین شهر", "جعفرآباد", "نمین",
		  "اصلاندوز", "مرادلو", "خلخال", "کوراییم", "هیر", "گیوی", "گرمی", "لاهرود", "هشتجین", "عنبران", "تازه کند", "قصابه",
		  "رضی", "سرعین", "بیله سوار", "آبی بیگلو", "زیار", "زرین شهر", "گلشن", "پیربکران", "خالدآباد", "سجزی", "گوگد",
		  "تیران", "ونک", "دهق", "زواره", "کاشان", "ابوزیدآباد", "اصغرآباد", "بافران", "شهرضا", "خور", "مجلسی", "هرند",
		  "فولادشهر", "کمشچه", "کلیشادوسودرجان", "لای بید", "قهجاورستان", "چرمهین", "رزوه", "فریدونشهر", "طرق رود", "نصرآباد",
		  "برزک", "سفیدشهر", "سمیرم", "گلدشت", "اردستان", "جوشقان قالی", "بویین ومیاندشت", "کرکوند", "درچه", "انارک",
		  "دولت آباد", "ایمانشهر", "گرگاب", "حسن اباد", "سده لنجان", "حبیب آباد", "بهاران شهر", "میمه", "تودشک", "گلشهر",
		  "رضوانشهر", "داران", "علویجه", "نیک آباد", "مشکات", "آران وبیدگل", "خوانسار", "نجف آباد", "منظریه", "فرخی", "دیزیچه",
		  "اژیه", "زاینده رود", "خورزوق", "قهدریجان", "شاهین شهر", "بهارستان", "چمگردان", "دهاقان", "برف انبار", "بادرود",
		  "کوهپایه", "گلپایگان", "عسگران", "حنا", "کهریزسنگ", "مهاباد", "کامو و چوگان", "افوس", "زیباشهر", "کوشک", "نایین",
		  "سین", "زازران", "مبارکه", "ورزنه", "ورنامخواست", "شاپورآباد", "فلاورجان", "وزوان", "اصفهان", "باغ بهادران", "چادگان",
		  "دامنه", "نطنز", "محمدآباد", "نیاسر", "نوش آباد", "کمه", "جوزدان", "قمصر", "جندق", "طالخونچه", "خمینی شهر", "باغشاد",
		  "دستگرد", "ابریشم", "آسارا", "کرج", "طالقان", "شهرجدیدهشتگرد", "محمدشهر", "مشکین دشت", "نظرآباد", "هشتگرد", "ماهدشت",
		  "اشتهارد", "کوهسار", "گرمدره", "تنکمان", "گلسار", "کمال شهر", "فردیس", "شباب", "موسیان", "بدره", "ایلام", "ایوان",
		  "مهران", "آسمان آباد", "پهله", "مهر", "سراب باغ", "بلاوه", "میمه", "دره شهر", "ارکواز", "مورموری", "توحید", "دهلران",
		  "لومار", "چوار", "زرنه", "صالح آباد", "سرابله", "ماژین", "دلگشا", "برازجان", "بندرریگ", "اهرم", "دوراهک", "خورموج",
		  "نخل تقی", "کلمه", "بندردیلم", "وحدتیه", "بنک", "چغادک", "بندردیر", "کاکی", "جم", "دالکی", "بندرگناوه", "آباد", "آبدان",
		  "خارک", "شنبه", "بوشکان", "انارستان", "شبانکاره", "سیراف", "دلوار", "بردستان", "بادوله", "عسلویه", "تنگ ارم", "امام حسن",
		  "سعد آباد", "بندرکنگان", "بوشهر", "بردخون", "آب پخش", "پیشوا", "جوادآباد", "ارجمند", "ری", "نصیرشهر", "رودهن", "اندیشه",
		  "نسیم شهر", "صباشهر", "ملارد", "شمشک", "پاکدشت", "باقرشهر", "احمد آباد مستوفی", "کیلان", "قرچک", "فردوسیه", "گلستان", "ورامین",
		  "فیروزکوه", "فشم", "پرند", "آبعلی", "چهاردانگه", "تهران", "بومهن", "وحیدیه", "صفادشت", "لواسان", "فرون اباد", "کهریزک",
		  "رباطکریم", "آبسرد", "باغستان", "صالحیه", "شهریار", "قدس", "تجریش", "شریف آباد", "حسن آباد", "اسلامشهر", "دماوند", "پردیس",
		  "گوجان", "گهرو", "سورشجان", "سرخون", "شهرکرد", "منج", "بروجن", "پردنجان", "سامان", "فرخ شهر", "صمصامی", "طاقانک", "کاج", "نقنه",
		  "لردگان", "باباحیدر", "دستنا", "سودجان", "بازفت", "هفشجان", "سردشت", "فرادبنه", "چلیچه", "بن", "فارسان", "شلمزار", "نافچ", "دشتک",
		  "بلداجی", "آلونی", "گندمان", "جونقان", "ناغان", "هارونی", "چلگرد", "کیان", "اردل", "سفیددشت", "مال خلیفه", "شوسف", "قاین", "عشق آباد",
		  "طبس مسینا", "ارسک", "آیسک", "نیمبلوک", "دیهوک", "سربیشه", "محمدشهر", "بیرجند", "فردوس", "نهبندان", "اسفدن",
		  "گزیک", "حاجی آباد", "سه قلعه", "آرین شهر", "مود", "خوسف", "قهستان", "بشرویه", "سرایان", "خضری دشت بیاض", "طبس",
		  "اسدیه", "زهان", "نیل شهر", "جنگل", "درود", "رباط سنگ", "سلطان آباد", "فریمان", "گناباد", "کاریز", "همت آباد",
		  "سلامی", "باجگیران", "بجستان", "چناران", "درگز", "کلات", "چکنه", "نصرآباد", "بردسکن", "مشهد", "کدکن", "نقاب",
		  "قلندرآباد", "کاشمر", "شاندیز", "نشتیفان", "ششتمد", "شادمهر", "عشق آباد", "چاپشلو", "رشتخوار", "قدمگاه", "صالح آباد",
		  "داورزن", "فرهادگرد", "کاخک", "مشهدریزه", "جغتای", "مزدآوند", "قوچان", "یونسی", "سنگان", "نوخندان", "کندر", "نیشابور",
		  "احمدابادصولت", "شهراباد", "رضویه", "تربت حیدریه", "باخرز", "سفیدسنگ", "بیدخت", "تایباد", "فیروزه", "قاسم آباد", "سبزوار", "فیض آباد", "گلمکان", "لطف آباد", "شهرزو", "خرو", "تربت جام", "انابد", "ملک آباد", "بایک", "دولت آباد", "سرخس", "ریوش", "طرقبه", "خواف", "روداب", "خلیل آباد", "راز", "پیش قلعه", "قوشخانه", "شوقان", "اسفراین", "گرمه", "قاضی", "شیروان", "حصارگرمخان", "آشخانه", "تیتکانلو", "جاجرم", "بجنورد", "درق", "آوا", "زیارت", "سنخواست", "صفی آباد", "ایور", "فاروج", "لوجلی", "بیدروبه", "شاوور", "حمزه", "گتوند", "شرافت", "منصوریه", "زهره", "رامهرمز", "بندرامام خمینی", "کوت عبداله", "میداود", "چغامیش", "ملاثانی", "چم گلک", "حر", "شمس آباد", "آبژدان", "چویبده", "مسجدسلیمان", "مقاومت", "ترکالکی", "دارخوین", "سردشت", "لالی", "کوت سیدنعیم", "حمیدیه", "دهدز", "قلعه تل", "میانرود", "رفیع", "اندیمشک", "الوان", "سالند", "صالح شهر", "اروندکنار", "سرداران", "تشان", "رامشیر", "شادگان", "بندرماهشهر", "جایزان", "بستان", "ویس", "اهواز", "فتح المبین", "شهر امام", "قلعه خواجه", "حسینیه", "گلگیر", "مینوشهر", "سماله", "شوشتر", "بهبهان", "هندیجان", "ابوحمیظه", "آغاجاری", "ایذه", "صیدون", "سیاه منصور", "هویزه", "آزادی", "شوش", "دزفول", "جنت مکان", "آبادان", "گوریه", "خرمشهر", "مشراگه", "خنافره", "چمران", "امیدیه", "سوسنگرد", "شیبان", "الهایی", "باغ ملک", "صفی آباد", "زرین رود", "آب بر", "ارمغانخانه", "کرسف", "هیدج", "سلطانیه", "خرمدره", "نیک پی", "قیدار", "ابهر", "دندی", "حلب", "نوربهار", "گرماب", "چورزق", "زنجان", "سهرورد", "صایین قلعه", "ماه نشان", "زرین آباد", "مجن", "دامغان", "سرخه", "مهدی شهر", "شاهرود", "سمنان", "کهن آباد", "گرمسار", "کلاته خیج", "دیباج", "درجزین", "رودیان", "بسطام", "امیریه", "میامی", "شهمیرزاد", "بیارجمند", "کلاته", "آرادان", "شهرک علی اکبر", "بنجار", "گلمورتی", "نگور", "راسک", "بنت", "قصرقند", "جالق", "هیدوچ", "نوک آباد", "زهک", "بمپور", "پیشین", "گشت", "محمدآباد", "زاهدان", "زابلی", "چاه بهار", "زرآباد", "بزمان", "اسپکه", "فنوج", "سراوان", "ادیمی", "زابل", "دوست محمد", "ایرانشهر", "سرباز", "سیرکان", "میرجاوه", "نصرت آباد", "سوران", "خاش", "کنارک", "محمدان", "نیک شهر", "کارزین (فتح آباد)", "فدامی", "خومه زار", "سلطان شهر", "فیروزآباد", "دبیران", "باب انار", "رامجرد", "سروستان", "قره بلاغ", "ارسنجان", "دژکرد", "بیرم", "دهرم", "شیراز", "ایزدخواست", "علامرودشت", "اوز", "وراوی", "بیضا", "نی ریز", "کنارتخته", "امام شهر", "جهرم", "بابامنیر", "گراش", "فسا", "شهرپیر", "حسن اباد", "کامفیروز", "خنج", "خانه زنیان", "استهبان", "بوانات", "لطیفی", "فراشبند", "زرقان", "صغاد", "اشکنان", "قایمیه", "گله دار", "دوبرجی", "آباده طشک", "خرامه", "میمند", "افزر", "دوزه", "سیدان", "کوپن", "زاهدشهر", "قادراباد", "سده", "بنارویه", "سعادت شهر", "شهرصدرا", "سورمق", "حسامی", "جویم", "خوزی", "اردکان", "قطرویه", "نودان", "مبارک آباددیز", "داراب", "نورآباد", "کوار", "نوبندگان", "حاجی آباد", "خاوران", "مرودشت", "کوهنجان", "ششده", "مزایجان", "ایج", "خور", "نوجین", "لپویی", "بهمن", "اهل", "خشت", "مهر", "جنت شهر", "مشکان", "بالاده", "قیر", "قطب آباد", "خانیمن", "مصیری", "میانشهر", "صفاشهر", "اقلید", "عمادده", "مادرسلیمان", "داریان", "رونیز", "کره ای", "لار", "اسیر", "هماشهر", "آباده", "لامرد", "بیدستان", "کوهین", "رازمیان", "خرمدشت", "آبگرم", "شال", "شریفیه", "اقبالیه", "نرجه", "ارداق", "الوند", "خاکعلی", "سیردان", "ضیاڈآباد", "بویین زهرا", "محمدیه", "محمودآبادنمونه", "معلم کلایه", "اسفرورین", "آوج", "دانسفهان", "آبیک", "قزوین", "تاکستان", "قم", "سلفچگان", "جعفریه", "قنوات", "دستجرد", "توپ آغاج", "سروآباد", "بویین سفلی", "زرینه", "دلبران", "سنندج", "یاسوکند", "موچش", "بانه", "مریوان", "سریش آباد", "صاحب", "دهگلان", "بابارشانی", "دیواندره", "برده رشه", "شویشه", "بیجار", "اورامان تخت", "کانی سور", "کانی دینار", "دزج", "سقز", "بلبان آباد", "پیرتاج", "کامیاران", "آرمرده", "چناره", "بلوک", "پاریز", "گنبکی", "زنگی آباد", "بم", "خانوک", "کیانشهر", "جوپار", "عنبرآباد", "جوزم", "نظام شهر", "لاله زار", "کشکوییه", "زیدآباد", "هنزا", "چترود", "جبالبارز", "سیرجان", "رودبار", "کرمان", "بافت", "صفاییه", "منوجان", "اندوهجرد", "هجدک", "خورسند", "امین شهر", "بردسیر", "رفسنجان", "هماشهر", "محمدآباد", "اختیارآباد", "بروات", "ریحان", "کوهبنان", "ماهان", "دوساری", "دهج", "فاریاب", "گلزار", "بهرمان", "بلورد", "فهرج", "کاظم آباد", "جیرفت", "نجف شهر", "قلعه گنج", "باغین", "بزنجان", "زرند", "نودژ", "گلباف", "راور", "خاتون اباد", "نرماشیر", "دشتکار", "مس سرچشمه", "خواجو شهر", "رابر", "راین", "درب بهشت", "یزدان شهر", "زهکلوت", "محی آباد", "مردهک", "شهداد", "ارزوییه", "نگار", "شهربابک", "انار", "شاهو", "بانوره", "تازه آباد", "هلشی", "جوانرود", "قصرشیرین", "نوسود", "کرند", "کوزران", "بیستون", "حمیل", "گیلانغرب", "سطر", "روانسر", "پاوه", "ازگله", "کرمانشاه", "میان راهان", "کنگاور", "سرپل ذهاب", "ریجاب", "باینگان", "هرسین", "اسلام آبادغرب", "سرمست", "سومار", "نودشه", "گهواره", "رباط", "صحنه", "گودین", "لنده", "سی سخت", "دهدشت", "یاسوج", "سرفاریاب", "دوگنبدان", "چیتاب", "لیکک", "دیشموک", "مادوان", "باشت", "پاتاوه", "قلعه رییسی", "مارگون", "چرام", "سوق", "مزرعه", "رامیان", "فراغی", "گنبدکاووس", "کردکوی", "مراوه", "بندرترکمن", "نگین شهر", "آق قلا", "سرخنکلاته", "گالیکش", "سنگدوین", "دلند", "بندرگز", "نوده خاندوز", "مینودشت", "گرگان", "گمیش تپه", "علی اباد", "خان ببین", "کلاله", "اینچه برون", "فاضل آباد", "تاتارعلیا", "نوکنده", "آزادشهر", "انبارآلوم", "جلین", "شلمان", "خشکبیجار", "ماکلوان", "سنگر", "مرجقل", "لیسار", "رضوانشهر", "رحیم آباد", "لوندویل", "احمدسرگوراب", "لوشان", "اطاقور", "لشت نشاء", "فومن", "چوبر", "بازار جمعه", "کلاچای", "بندرانزلی", "املش", "رستم آباد", "لاهیجان", "توتکابن", "لنگرود", "کوچصفهان", "صومعه سرا", "اسالم", "دیلمان", "رودسر", "کیاشهر", "شفت", "رودبار", "کومله", "رشت", "ماسوله", "خمام", "ماسال", "واجارگاه", "هشتپر (تالش)", "پره سر", "بره سر", "آستارا", "رودبنه", "جیرنده", "چاف و چمخاله", "لولمان", "گوراب زرمیخ", "حویق", "سیاهکل", "چابکسر", "آستانه اشرفیه", "رانکوه", "بیران شهر", "ویسیان", "شول آباد", "پلدختر", "کوهدشت", "هفت چشمه", "بروجرد", "الشتر", "مومن آباد", "دورود", "زاغه", "چقابل", "الیگودرز", "معمولان", "کوهنانی", "نورآباد", "سپیددشت", "سراب دوره", "ازنا", "گراب", "خرم آباد", "اشترینان", "فیروزآباد", "درب گنبد", "گلوگاه", "پل سفید", "دابودشت", "چالوس", "کیاسر", "بهنمیر", "تنکابن", "کلاردشت", "ایزدشهر", "گتاب", "سلمان شهر", "ارطه", "امیرکلا", "کوهی خیل", "پایین هولار", "گزنک", "محمودآباد", "رامسر", "نوشهر", "خلیل شهر", "کیاکلا", "نور", "مرزیکلا", "فریدونکنار", "زیرآب", "امامزاده عبدالله", "هچیرود", "فریم", "هادی شهر", "نشتارود", "پول", "بهشهر", "کلارآباد", "بلده", "بابل", "جویبار", "آلاشت", "آمل", "نکا", "کتالم وسادات شهر", "بابلسر", "شیرود", "شیرگاه", "رویان", "زرگرمحله", "عباس اباد", "قایم شهر", "خوش رودپی", "مرزن آباد", "ساری", "رینه", "سرخرود", "خرم آباد", "کجور", "رستمکلا", "سورک", "چمستان", "خنجین", "نراق", "کمیجان", "آشتیان", "رازقان", "مهاجران", "غرق آباد", "خنداب", "قورچی باشی", "خشکرود", "ساروق", "محلات", "شازند", "ساوه", "میلاجرد", "تفرش", "زاویه", "اراک", "توره", "نوبران", "فرمهین", "دلیجان", "پرندک", "کارچان", "نیمور", "هندودر", "آوه", "جاورسیان", "خمین", "مامونیه", "داودآباد", "شهباز", "تیرور", "گروک", "قشم", "کوشکنار", "کیش", "سرگز", "بندرعباس", "زیارتعلی", "سندرک", "کوهستک", "لمزان", "رویدر", "قلعه قاضی", "فارغان", "ابوموسی", "هشتبندی", "سردشت", "درگهان", "پارسیان", "کنگ", "جناح", "تازیان پایین", "دهبارز", "میناب", "سیریک", "سوزا", "خمیر", "چارک", "حاجی اباد", "فین", "بندرجاسک", "گوهران", "هرمز", "دشتی", "بندرلنگه", "بستک", "تخت", "دمق", "سرکان", "آجین", "جورقان", "برزول", "فامنین", "سامن", "بهار", "فرسفج", "شیرین سو", "مریانج", "فیروزان", "قروه درجزین", "ازندریان", "لالجین", "گل تپه", "گیان", "ملایر", "صالح آباد", "تویسرکان", "اسدآباد", "همدان", "نهاوند", "رزن", "جوکار", "مهاجران", "کبودرآهنگ", "قهاوند", "مهردشت", "حمیدیا", "تفت", "اشکذر", "ندوشن", "یزد", "عقدا", "بهاباد", "ابرکوه", "زارچ", "نیر", "اردکان", "هرات", "بفروییه", "شاهدیه", "بافق", "خضرآباد", "میبد", "مهریز", "احمدآباد"
	 ];
}
